apache-camel-integration/RequestResponseXMLs/ReservationServiceAirlineARequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quot="http://aira.sample.com/quote/">
   <soapenv:Header/>
   <soapenv:Body>
      <quot:getQuote>
         <getQuote>
            <source>CHN</source>
            <destination>HYD</destination>
            <date>25/09/2013</date>
            <!--Optional:-->
            <airline>All</airline>
         </getQuote>
      </quot:getQuote>
   </soapenv:Body>
</soapenv:Envelope>